Revit 2027 API
ImportIFCOptions.GetImportIFCOptions Method
 Returns the current Revit instance's ImportIFCOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ImportIFCOptions GetImportIFCOptions()
Public Shared Function GetImportIFCOptions As ImportIFCOptions
public:
static ImportIFCOptions^ GetImportIFCOptions()
static member GetImportIFCOptions : unit -> ImportIFCOptions
Return Value
ImportIFCOptions
 The ImportIFCOptions for the current Revit instance.
See Also
Reference
ImportIFCOptions Class
Autodesk.Revit.DB Namespace